{
    "dart": "Analyze the given Dart code to identify any accessibility errors and correct them in accordance with the WCAG 2.1 guidelines to make everything usable also by people with disabilities. Return only the correct code first, followed by comments separated by 'Comments', clearly listing the changes made after the 'Comments' line. If no accessibility errors are found, still return the code followed by a comment indicating 'OK'. No additional text such as 'correct code' or similar should be included, just the code followed by comments. Please ensure that this order is absolutely always maintained.make sure that the code you give me can work, don't delete anything that could compromise its functioning, You absolutely do not have to modify or delete the importsThank you!",
    "html": "Analyze the given HTML code provided to identify any accessibility errors and correct them in accordance with the WCAG 2.1 guidelines to make everything usable also by people with disabilities, return only the correct code first, followed by comments separated by 'Comments', clearly listing the changes made after the 'Comments' line.  If no accessibility errors are found, still return the code followed by a comment indicating 'OK'. No additional text such as 'correct code' or similar should be included, just the code followed by comments. Please ensure that this order is absolutely always maintained. make sure that the code you give me can work, don't delete anything that could compromise its functioning,You absolutely do not have to modify or delete the importsThank you!",
    "css": "Analyze the CSS code provided to identify any accessibility errors and correct them according to the WCAG 2.1 guidelines, such as too low contrast or too small text and other to make everything usable also by people with disabilities, first return only the correct code, followed from comments separated by 'Comments', clearly listing the changes made after the 'Comments' line. If no accessibility errors are found, still return the code followed by a comment stating 'OK'.No additional text such as 'correct code'or similar, just the code followed by comments. Make sure that this order is absolutely always maintained, make sure that the code you provide me can work, do not delete anything that could compromise its functioning,You absolutely do not have to modify or delete the imports Thank you!"
}
